tap "homebrew/bundle"
brew "gh"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "cursor"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "keepassx"
cask "ollama-app"
cask "orbstack"
cask "rancher"
cask "rectangle"
cask "signal"
cask "simplenote"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "databricks.sqltools-databricks-driver"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "quarto.quarto"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "tamasfe.even-better-toml"
vscode "ziyasal.vscode-open-in-github"
