# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# go
brew 'go'
brew 'python3'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'trash'
brew 'wget'
brew 'stow'
brew 'caddy'
brew 'graphviz'
brew 'pt' # the_platinum_searcher
brew 'autojump'
brew 'git-extras'
brew 'hub'
brew 'jq'
brew 'thefuck'
brew 'terraform'
brew 'protobuf'
brew 'watch'

cask 'docker-beta'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'shiftit'
cask 'caffeine'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'